[
  {
    "id": "post-2137542659647715265",
    "title": "So, you want to travel back",
    "date": "2025-04-19", // Using YYYY-MM-DD format for consistency
    "excerpt": "\"So, you want to travel back, for you could not contain, could not refrain, that boundless hunger deep within, For all the changes you could pinch...\" Like a hawk that couldn’t be caged anymore...",
    "contentMarkdown": "`\n\"So, you want to travel back,<br>\nfor you could not contain,<br>\ncould not refrain,<br>\nthat boundless hunger deep within,<br>\nFor all the changes you could pinch,<br><br>\n\nSo, you want to travel back,<br>\nto gain control that with time lost,<br>\nfor all mistakes that bore a heavy cost,<br>\nreassure the freedom thereafter,<br>\nstripping off all thy past disasters,<br><br>\n\nSo, you want to travel back,<br>\nFor all the changes you could etch,<br>\nfor all harmony that would cling,<br>\nfrom Serenity you longed to fetch,<br>\nfrom the compassion that you'd bring,<br><br>\n\nLike a hawk that couldn’t be caged anymore\n\nLike tending a wound that couldn’t be restored\n\nLike gazing at beauty that can’t be mirrored <br>\n\n<br>\n\nAnd, So, you will travel back,<br>\nto arrive as peaceful as still marine water,<br>\nto garner stillness, that of a weaver,<br>\nwhose final thread is laid,<br>\nwith all the glory and praises,<br>\nthat reality relentlessly raises,\n\nSo, you will travel back,<br>\nFor the cosmic loom to set itself,<br>\nlinear as it ever was,<br>\nfor thy doomed fate to let itself,<br>\nbound as tight as ever was,\n\nSo, you will travel back,<br>\nnever truly to embrace,<br>\nto forever unknowingly interlace,<br>\nthe desperate want to travel back\"\n`"
  },
  {
    "id": "post-3486396209614590705",
    "title": "The Cost of Belonging",
    "date": "2025-04-18",
    "excerpt": "Was I born different? What did I do different that made me the way I am? These are some of the questions that rebels like myself ask themselves at some point in life, probably after realizing how fucked up the world really is...",
    "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEip3ZrMKuCmNmLRWzLwAjWcdLb-6hiRkqvXgzy9MVw1EOK1gl6vbfLoDZAXikzJnWMwfrE-yt1HTccVetYPRXeFUYXGH4NTSDxGDpKmVzbu0K6Pm0QOsPwsQ_J7ME3aiYOeSwpW7LLTNGU3aq4nP4qF8F7_BndRE74cWz1P2a11dY-1_byeX_ubO-hhV1U/s1600/For%20yt%20music.jpg", // Added optional image field
    "imageAlt": "Abstract circular design with purple and black elements, possibly album art", // Added alt text
    "contentMarkdown": "`\nWas I born different? <br> What did I do different that made me the way I am?\n\nThese are some of the questions that rebels like myself ask themselves at some point in life, probably after realizing how fucked up the world really is and how much control you really have, can’t put an age up at this, it’s different for everyone.\n\nThis might just also be the time that we find ourselves a bit more depressed than usual and start looking out for those tiny moments of happiness since life isn’t playdough anymore. We might find ourselves having thoughts of travelling back through time to when things were simpler, when we were not as rebellious as we are right now.\n\nLet’s define our terms, shall we? What do I mean by a ‘rebel’ and being ‘rebellious’?\n\nSee I like to believe that the world is divided into two kinds of people, the usual sheep-like ‘Conformists’ and the ever changing, fed up with the system, ‘Rebels’\n\n**Why Are We Raised to Obey, Not to Think?**\n\nWhy is it that as kids—and even as teens—we’re never really taught how to *think*? We're only taught how to *obey*. Respect your elders. Follow the rules. Conformity is the default setting, especially enforced by family and state. Parents are given a blank slate the moment we’re born. They can raise a rebel… or shape a command-obeying conformist.\n\nSo, here’s the question:<br> **What’s right or wrong with either of these ideologies?**<br> And the deeper one—**how long can someone truly stay in a conformist state before cracking?**\n\nThese questions unravel more beneath them. Which idea of liberation deserves more value? How much influence do parents really hold over the wiring of a child’s identity?\n\nLet’s address the first question. Anyone with a functioning brain, basic observational skills, and even a hint of logic *should* already know the answer—given the world we live in today.\n\nLet me be blunt: I’m heavily biased. I’m a free soul. I despise authority of any kind. I believe a man of logic should follow reasoning, *not* orders. And no, this isn’t some utopian delusion. We don't live in an ideal world. Anyone who's grown out of their childhood innocence can *see* it. It doesn't stop with just your own country—look around, dig deeper. You'll arrive at the same conclusion:<br> **Everyone. Everywhere. Is messed up.**\n\nSociety, globally, is broken. And here’s the part that stings: the majority of it is made up of *conformists*.\n\nLook at Trump’s re-election. Look at a Chai-wala’s turned supreme leader riding the wave of blind devotion for over a decade. If that’s not enough to blame the downfall on mass conformity, I don’t know what is.\n\nAnd rebels?<br> What do a handful of rebels even achieve—except martyrdom?\n\nHistory has Proof. Narendra Dabholkar. Gauri Lankesh. Journalists. Whistleblowers. Silenced. Gunned down. Forgotten. Most conformists don’t even *know* about their sacrifices.\n\nSome days, I find myself genuinely believing that this world mostly comprises of and run by retards.\n\nIs it really that hard to not get brainwashed?<br> To hold an objective thought before buying into something?<br> To question *anything* you encounter?\n\nApparently, for most—it is.\n\nAnd that’s terrifying.\n\nAnother question we don’t ask enough:<br> **How much damage do cover-ups, lies, and secrecy cause when authorities mess up?**<br> Maybe I’ll dig into that next time. But for now, let me say this:\n\n*Conformity*—as a global disease—should be viewed with the same suspicion we reserve for *communism* (or any ideology when taken to the extreme). The world would be better off without blind followers.\n\nAnd here comes the final—and maybe trickiest—question:<br> **How long can one stay a conformist? And how much of that is because of parenting?**\n\nIn my case, both my parents are conformists. The only rebellion they seem to show is *towards me*. They’ve never been the curious type. Never stirred trouble. Unless something extreme happens—or someone they care about is at risk—they’ll stay quiet. Safe. Predictable.\n\nBy that logic, I should’ve turned out exactly like them.\n\nBut I didn’t.\n\nI’m the polar opposite. I question *everything*. I overthink *everything*.<br> Why? Probably because I surrounded myself with… *no one*.<br> No friends. Just books. YouTube. My own thoughts. Isolation breeds introspection.\n\nThis needs to be studied more, honestly. I can’t draw conclusions from just one case. But if I had to bet—I'd say rebels are born this way. I was fed the same ideas as everyone else. But something in me rejected them all.\n\nAnd here I am.\n`"
  }
  // Add more post objects here later, following the same structure
]
